core/app/Models/Deposit.php

    public function gatewayCurrency()
    {
        return GatewayCurrency::where('method_code', $this->method_code)->where('currency', $this->method_currency)->first();
---
select * from `gateway_currencies` where `method_code` = 1002 and `currency` = 'USDT' limit 1