core/app/Http/Helpers/helpers.php

function teamSizeToday($id, $level)
{
    $myref  = showBelow($id);
    $nxt    = $myref;

    for ($i = 1; $i < $level; $i++) {
        $nxt = array();
        foreach ($myref as $uu) {
            $n = showBelow($uu);
            $nxt = array_merge($nxt, $n);
        }
        $myref = $nxt;
    }

    $count = 0;
    foreach ($nxt as $uu) {
        $count += User::where('id', $uu)->whereDate('created_at', Carbon::today())->count();
---
select * from `users` where `id` = 2 limit 1